
alert("Այս էջում դուք կարող եք իմանալ, թե ձեզ որքան ժամանակ է մնացել ապրելու՞");


var a = prompt("Ինչպես է ձեր անունը?");
a = parseInt(a);

var x = prompt("Քանի տարեկան եք?");
x = parseInt(x);

var y = prompt("Սպորտով քանի անգամ եք զբաղվում մեկ շաբաթվա մեջ?");
y = parseInt(y);

var z = prompt("Սիրում եք հաց ուտել?");
z = parseInt(z);

var a = prompt("Առավոտյան շատ շուտ եք արթնանում?");
x = parseInt(x);

var b = prompt("Երգ սիրում եք լսել?");
y = parseInt(y);

var c = prompt("Ձեր ջուրը <<Վիոլյա ջուր>> կազմակերպությունն է մատակարարում ?");
z = parseInt(z);

var d = Math.floor(Math.random()*100+70);




if (x==10) { 
 alert ("Փախար էէէէէ, մեր կազմակերպությունը այդ տարիքի մարդկանց համար թեստ չի անում");

}

else if(x==14){
  alert ("Դուք անմահ եք");  
}

else {
     alert ("Դուք կմահանաք " + d + " տարի անց");  
}

